alfred
alt-tab
appcleaner
bitwarden
bruno
batteryboi
command-x
discord
docker
itsycal
figma
font-fira-code-nerd-font
font-fira-mono-nerd-font
font-jetbrains-mono-nerd-font
font-roboto-mono-nerd-font
font-mononoki-nerd-font
hiddenbar
jukebox
keka
maccy
obsidian
rectangle
spotify
typora
ubersicht
visual-studio-code
firefox-developer-edition
