commitizen
eza
fx
fzf
fastfetch
gh
git
go
howdoi
jq
k9s
neovim
pnpm
postgresql@14
pyenv
pyenv-virtualenv
spicetify-cli
sqlite
stow
thefuck
tldr
wget
xclip
zlib
zoxide
