# ------
# Homebrew Taps
# ------
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
# ------
# Brews
# ------
brew "bat"
brew "commitizen"
brew "eza"
brew "fastfetch"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "howdoi"
brew "jq"
brew "k9s"
brew "mas"
brew "neovim"
brew "pnpm"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "spicetify-cli"
brew "stow"
brew "thefuck"
brew "tldr"
brew "wget"
brew "xclip"
brew "zlib"
brew "zoxide"
# ------
# Casks
# ------
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "bitwarden"
cask "bruno"
cask "batteryboi"
cask "calibre"
cask "command-x"
cask "discord"
cask "docker"
cask "itsycal"
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-mononoki-nerd-font"
cask "hiddenbar"
cask "jukebox"
cask "keka"
cask "maccy"
cask "obsidian"
cask "rectangle"
cask "spotify"
cask "typora"
cask "ubersicht"
cask "visual-studio-code"
cask "firefox-developer-edition"
# ------
# Mac App Store Apps
# ------
mas "Zones: Time Zone Conversion", id: 1612523936
mas "Colorslurp", id: 1287239339
mas "Dropover - Easier Drag & Drop", id: 1355679052
