# ------
# Homebrew Taps
# ------
tap "homebrew/bundle"
tap "homebrew/cask-versions"
# ------
# Brews
# ------
brew "ast-grep"
brew "atuin"
brew "bat"
brew "btop"
brew "commitizen"
brew "direnv"
brew "doppler"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "go-task"
brew "howdoi"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kepubify"
brew "lazydocker"
brew "mas"
brew "navi"
brew "neovim"
brew "pnpm"
brew "postgresql@14"
brew "pre-commit"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "scroll-reverser"
brew "spicetify-cli"
brew "stow"
brew "thefuck"
brew "tldr"
brew "wget"
brew "xclip"
brew "yazi"
brew "zellij"
brew "zlib"
brew "zoxide"
# ------
# Casks
# ------
cask "affinity-designer"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "batteryboi"
cask "bitwarden"
cask "bruno"
cask "calibre"
cask "command-x"
cask "coteditor"
cask "discord"
cask "docker"
cask "ente-auth"
cask "figma"
cask "firefox-developer-edition"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "hiddenbar"
cask "jukebox"
cask "keka"
cask "maccy"
cask "msty"
cask "obsidian"
cask "qbittorrent"
cask "raindropio"
cask "rectangle"
cask "scroll-reverser"
cask "shottr"
cask "spotify"
cask "typora"
cask "ubersicht"
cask "visual-studio-code"
cask "whisky"
# ------
# Mac App Store Apps
# ------
mas "Colorslurp", id: 1287239339
mas "Dropover - Easier Drag & Drop", id: 1355679052
mas "Zones: Time Zone Conversion", id: 1612523936
